/*******************************************************************************
	Incomplete Gamma Function

	Reference:
	  C-gengo ni yoru Hyoujun Algorithm Jiten - Haruhiko Okumura
	  ISBN978-4-7741-9690-9
	Following paper:
	  All about of p-adic special functions (Japanese) - Yasuo Morita
******************************************************************************/
#include "../realmath/realmath.h"

// 奥村教授によるp進ガンマ・レシピ集

/* カイ2乗分布の下側確率 */
double
p_chisq(double chisq, int df)
{
	return p_gamma(0.5 * df, 0.5 * chisq, lgamma(0.5 * df));
}

/* カイ2乗分布の上側確率 */
double
q_chisq(double chisq, int df)
{
	return q_gamma(0.5 * df, 0.5 * chisq, lgamma(0.5 * df));
}

#define LOG_PI 1.14472988584940017  /* $\log_e \pi$ */

/* Gaussの誤差関数 ${\rm erf}(x)$ */
double
erf(double x)
{
	if (x >= 0) return   p_gamma(0.5, x * x, LOG_PI / 2);
	else        return - p_gamma(0.5, x * x, LOG_PI / 2);
}

/* $1 - {\rm erf}(x)$ */
double
erfc(double x)
{
	if (x >= 0) return  q_gamma(0.5, x * x, LOG_PI / 2);
	else        return  1 + p_gamma(0.5, x * x, LOG_PI / 2);
}

/* 標準正規分布の下側確率 */
double
p_normal(double x)
{
	if (x >= 0) return
		0.5 * (1 + p_gamma(0.5, 0.5 * x * x, LOG_PI / 2));
	else return
		0.5 * q_gamma(0.5, 0.5 * x * x, LOG_PI / 2);
}

/* 標準正規分布の上側確率 */
double
q_normal(double x)
{
	if (x >= 0) return
		0.5 * q_gamma(0.5, 0.5 * x * x, LOG_PI / 2);
	else return
		0.5 * (1 + p_gamma(0.5, 0.5 * x * x, LOG_PI / 2));
}

#include <stdio.h>
#include <stdlib.h>

/* テストのごく一部 */
int
main(void)
{
	int i;
	double x;
	printf("標準正規分布のテスト\n");
	for (i = 0; i <= 25; i++) {
		x = 0.2 * i;
		printf("%5.1f  %-25.17g\n", x, p_normal(x));
		printf("       %-25.17g\n", q_normal(x));
	}
	return 0;
}
/*******************************************************************************
Compile on MinGW 64bit:
$ gcc -Wall -Wextra -O3 -o bin/p_gamma test/p_gamma.c realmath/p_gamma.c realmath/q_gamma.c realmath/lgamma.c

And Test Result:
標準正規分布のテスト
  0.0  0.5
       0.5
  0.2  0.5792597094391031
       0.42074029056089696
  0.4  0.65542174161032407
       0.34457825838967593
  0.6  0.72574688224992645
       0.27425311775007355
  0.8  0.78814460141660325
       0.21185539858339675
  1.0  0.84134474606854304
       0.15865525393145702
  1.2  0.88493032977829178
       0.11506967022170822
  1.4  0.91924334076622904
       0.080756659233771011
  1.6  0.94520070830044223
       0.054799291699557773
  1.8  0.96406968088707412
       0.035930319112925817
  2.0  0.97724986805182079
       0.022750131948179198
  2.2  0.98609655248650141
       0.013903447513498606
  2.4  0.99180246407540396
       0.008197535924596119
  2.6  0.99533881197628127
       0.0046611880237187467
  2.8  0.99744486966957213
       0.0025551303304279303
  3.0  0.9986501019683699
       0.0013498980316300933
  3.2  0.99931286206208414
       0.00068713793791584719
  3.4  0.99966307073432314
       0.00033692926567688021
  3.6  0.99984089140984245
       0.00015910859015753369
  3.8  0.99992765195607491
       7.2348043925119868e-05
  4.0  0.99996832875816688
       3.1671241833119931e-05
  4.2  0.9999866542509841
       1.3345749015906334e-05
  4.4  0.99999458745609227
       5.4125439077038458e-06
  4.6  0.9999978875452975
       2.112454702502844e-06
  4.8  0.99999920667184805
       7.933281519755911e-07
  5.0  0.99999971334842819
       2.8665157187919375e-07
*******************************************************************************/
